//1. 默认参数 default (参数变量后赋值)
function fnAdd1(x, y = 1) {
    return x + y; 
}
function fnAdd(x, y) {
    return x + y; 
}

//使用默认值
console.log("默认值：1+1=%d", fnAdd1(1)); 

//使用未定义值
console.log("未定义：1+u=%d", fnAdd(1)); 

//------------------------------------------------------------------------
//2. 剩余参数 rest (使用省略号)
// 将剩余参数自动封装为数组
function sum(a, b, ...c) {
    console.log("剩余参数 rest:", c); 
}
sum(1, 2, 3, 4, 5, 6); 

//------------------------------------------------------------------------
//3. 扩展运算符 spread(使用省略号)
// 与剩余参数相反，将数组分解为多个值(用逗号分隔的参数序列)
var data = [ 2, 3, 4]; 
console.log("数组：", 1, data, 5); 
console.log("序列：", 1, ...data, 5); 